[
  {
    "description": "Use this API to look up the full address for a UK postcode. Includes an optional filter to narrow by house number and street name.",
    "identifier": "address-lookup"
  },
  {
    "description": "For tax agents requesting authorisation to act on a client’s behalf.\n\nReplacing the 64-8 paper form, use this API to set up new authorisation requests and check the status, cancel or query a request.",
    "identifier": "agent-authorisation-api"
  },
  {
    "description": "For testing only. Test accepting or rejecting an authorisation request created using the Agent Authorisation API.",
    "identifier": "agent-authorisation-test-support-api"
  },
  {
    "description": "Create dummy individual, agent, and organisation accounts for testing user-restricted endpoints in our sandbox.",
    "identifier": "api-platform-test-user"
  },
  {
    "description": "Set up test data to verify expected behaviour for the Breathing Space API.",
    "identifier": "breathing-space-if-dynamic-stub"
  },
  {
    "description": "Create, update and view Breathing Space periods. Use an individual’s NINO to get personal information about coded-out and current debts.",
    "identifier": "breathing-space-if-proxy"
  },
  {
    "description": "Use this API to list all businesses associated with an individual and retrieve additional information each business.",
    "identifier": "business-details-api"
  },
  {
    "description": "This API allows users to search, view and manage property services in relation to business rates. \n\nRequires pre-registration with the Valuation Office Agency (VOA).",
    "identifier": "business-rates-api"
  },
  {
    "description": "This API allows users to check if an importer/exporter’s UK Economic Operator Registration Identification (EORI) number is valid. This is for numbers beginning ‘GB’.",
    "identifier": "check-eori-number-api"
  },
  {
    "description": "View and manage Construction Industry Scheme (CIS) deductions.\n\nUse this API to retrieve, create, remove and override information CIS contractors have submitted to HMRC.",
    "identifier": "cis-deductions-api"
  },
  {
    "description": "Use the Common Transit Convention (CTC) API to tell traders their guarantee funds balance.",
    "identifier": "common-transit-convention-guarantee-balance"
  },
  {
    "description": "The Common Transit Convention (CTC) API sends departure and arrival notifications to the New Computerised Transit System (NCTS). It also retrieves messages from departure and destination customs offices.",
    "identifier": "common-transit-convention-traders"
  },
  {
    "description": "An API to submit Union Custom Code (UCC) Declarations for processing and approval by the Customs Declaration Service. It allows users to cancel a pre-request while in pre-clearance, and provides a route to securely upload additional documentation.",
    "identifier": "customs-declarations"
  },
  {
    "description": "Use this API to search and get details of a Customs Declaration. Users can search based on role, category, date, goods location code and status.",
    "identifier": "customs-declarations-information"
  },
  {
    "description": "Enables functionality for the Inventory Linking Export process to control and monitor cargo in transit.\n\nThis API supports three functional areas: consolidation, movement and query.",
    "identifier": "customs-inventory-linking-exports"
  },
  {
    "description": "This API validates movement response messages provided by Community System Providers (CSP). It matches the outcome of a Declaration ID against an Inventory Consignment Reference (ICR).",
    "identifier": "customs-inventory-linking-imports"
  },
  {
    "description": "An API to test email events including delivered, bounced, opened and clicked links.",
    "identifier": "email-events"
  },
  {
    "description": "Submit information to the Excise Movement Control System (EMCS) including movement notices, view messages from EMCS and retrieve information about traders.",
    "identifier": "excise-movement-control-system-api"
  },
  {
    "description": "Provides a Shared Signals Framework to accept security related events to HMRC. The GDS signals are transmitted in the form of a Security Event Token (SET) which are signed and verified.",
    "identifier": "gds-signals-receiver"
  },
  {
    "description": "This API links declaration references, the movement of goods to declarations, and notifies users when their inbound goods have successfully cleared HMRC systems in the UK.",
    "identifier": "goods-movement-system-carrier-api"
  },
  {
    "description": "This API creates, updates and deletes Goods Movement Records (GMRs). It lists active GMRs and notifies users when inbound goods have successfully cleared UK HMRC systems.",
    "identifier": "goods-movement-system-haulier-api"
  },
  {
    "description": "Get Goods Movement Records (GRM) details that have embarked, arrived or checked-in for departure at a Goods Vehicle Movement Service (GVMS) border location. This API also gets GVMS reference data.",
    "identifier": "goods-movement-system-port-api"
  },
  {
    "description": "Find Goods Movement Records (GMR) for customs and transit declaration IDs, or Vehicle Registration Numbers. Get GVMS reference data and place inspection holds on GMRs moving on the Great Britain to Northern Ireland route.",
    "identifier": "goods-movement-system-search-api"
  },
  {
    "description": "This API gets questions from a set of identifiers and matches the user entered response.",
    "identifier": "identity-verification-questions"
  },
  {
    "description": "This API will generate a list of, acknowledge and retrieve Entry Summary Declarations (ENS) notifications.",
    "identifier": "import-control-entry-declaration-intervention"
  },
  {
    "description": "This API will list, retrieve and acknowledge Safety and Security Import Outcomes.",
    "identifier": "import-control-entry-declaration-outcome"
  },
  {
    "description": "This API is used to set up new, and amend existing Entry Summary Declarations (ENS) submissions.",
    "identifier": "import-control-entry-declaration-store"
  },
  {
    "description": "Supporting the process of goods arriving in Northern Ireland, this API allows users to submit presentation notifications to Customs, check inspection dates and notify Customs where goods don’t need inspection.",
    "identifier": "import-control-presentation-of-goods"
  },
  {
    "description": "Provide information about an employee, or director’s benefits, as reported to HMRC by the employer.\n\nThis API is designed to pre-populate an individual’s Self-Assessment tax return.",
    "identifier": "individual-benefits"
  },
  {
    "description": "Use this API to trigger, list, retrieve and submit a customer’s self-assessment tax calculation.",
    "identifier": "individual-calculations-api"
  },
  {
    "description": "This API shares information HMRC holds including; employment history, employer PAYE reference, employer’s name and an off payroll work flag where applicable.",
    "identifier": "individual-employment"
  },
  {
    "description": "This API shares information HMRC holds including; employment history, employer PAYE reference, employer’s name and an off payroll work flag where applicable.",
    "identifier": "individual-income"
  },
  {
    "description": "This API shares information HMRC holds including; employment history, employer PAYE reference, employer’s name and an off payroll work flag where applicable.",
    "identifier": "individual-income-des-stub"
  },
  {
    "description": "This API provides financial data and allows users to create, show, update and delete Brought Forward Losses and Loss Claims.",
    "identifier": "individual-losses-api"
  },
  {
    "description": "Retrieve the information HMRC holds about an individual’s tax affairs including; tax deducted from their annual gross income, pensions, incapacity benefit, and tax refunds.",
    "identifier": "individual-tax"
  },
  {
    "description": "Submit a declaration confirming the submission date for a business has completed.",
    "identifier": "individuals-business-eops-api"
  },
  {
    "description": "An API to provide financial data for pensions charges. Use this API to retrieve, create, amend and delete pension charges.",
    "identifier": "individuals-charges-api"
  },
  {
    "description": "An API which allows agents to manage Child Benefit claims. Includes: get claimants relationships and details of their children, create a Child Benefit claim and match birth registration.",
    "identifier": "individuals-child-benefit-api"
  },
  {
    "description": "This API creates, amends, retrieves and deletes data relating to Marriage Allowance and Individuals Disclosures.",
    "identifier": "individuals-disclosures-api"
  },
  {
    "description": "This API creates, amends, retrieves and deletes data relating to Trade Union income, Patent Royalties and existing employment expenses.",
    "identifier": "individuals-expenses-api"
  },
  {
    "description": "For testing only. Create dummy user details, PAYE, benefits and credits test data for an individual. This API will also create self assessment, corporation tax, VAT and multiple employee test data for an organisation.",
    "identifier": "individuals-if-api-stub"
  },
  {
    "description": "Get information about an individual's income from employment, pensions and retirement annuities and other state benefits or grants.",
    "identifier": "individuals-income-received-api"
  },
  {
    "description": "Get HMRC records to find out information about an individual.",
    "identifier": "individuals-matching-api"
  },
  {
    "description": "Create, amend, retrieve and delete data relating to relief from investments and subscriptions.",
    "identifier": "individuals-reliefs-api"
  },
  {
    "description": "Create, amend and retrieve information relating to an individual’s State Benefits.",
    "identifier": "individuals-state-benefits-api"
  },
  {
    "description": "Allow 3rd-party supplies to submit scanned copies of VAT returns for insolvent companies.",
    "identifier": "insolvent-vat-api"
  },
  {
    "description": "This API calculates the interest accrued to one or multiple customer debts. It retrieves configurable information including the interest rates applied, and a debt calculation.",
    "identifier": "interest-forecasting"
  },
  {
    "description": "Appoint or revoke a Reporting Company’s access to submit Interest Restriction Returns (IRR). This API also enables submission of full or abbreviated Interest Restriction Returns.",
    "identifier": "interest-restriction-return"
  },
  {
    "description": "An API that checks if users are authorised to create and retrieve session data.",
    "identifier": "iv-orchestration"
  },
  {
    "description": "Create and manage lifetime ISA (LISA) accounts including requesting and transferring event details, withdrawals and debt information.",
    "identifier": "lisa-api"
  },
  {
    "description": "An API to get Marriage Allowance status and check eligibility.",
    "identifier": "marriage-allowance"
  },
  {
    "description": "Create test data for the Marriage Allowance API.",
    "identifier": "marriage-allowance-des-stub"
  },
  {
    "description": "Send a single or multiple events to the tax platform for auditing.",
    "identifier": "mobile-audit"
  },
  {
    "description": "Get details of the Help to Save account for HMRC Mobile app.",
    "identifier": "mobile-help-to-save"
  },
  {
    "description": "Get a metadata list of all the user's digital messages such as Digital Contact or Online Letters from HMRC.",
    "identifier": "mobile-messages"
  },
  {
    "description": "Get PAYE data in a defined format for HMRC Mobile App developers.",
    "identifier": "mobile-paye"
  },
  {
    "description": "A calling system to send push notifications to the HMRC mobile app.",
    "identifier": "mobile-push-notifications-orchestration"
  },
  {
    "description": "Register iOS and Android devices for push notifications. Used by HMRC Mobile App developers.",
    "identifier": "mobile-push-notifications-registration"
  },
  {
    "description": "Get startup data to initialise mobile apps. This API uses an authentication token to identify the National Insurance Number (NINO) to identify the user.",
    "identifier": "mobile-startup"
  },
  {
    "description": "Submit tax credits renewal information.",
    "identifier": "mobile-tax-credits-renewal"
  },
  {
    "description": "Get tax credits summary information.",
    "identifier": "mobile-tax-credits-summary"
  },
  {
    "description": "Submits user feedback from HMRC Mobile app when a feedback submission is added to the queue.",
    "identifier": "mobile-user-contact"
  },
  {
    "description": "Get test support for MTD Self-Assessment APIs.",
    "identifier": "mtd-sa-test-support-api"
  },
  {
    "description": "View earnings subject to National Insurance (NI) and payments due.\n\nThis API is primarily used to calculate a taxpayer’s NI liability within Self Assessment.",
    "identifier": "national-insurance"
  },
  {
    "description": "Set up test data to use with the National Insurance API.",
    "identifier": "national-insurance-des-stub"
  },
  {
    "description": "Get a National Insurance record summary and tax year details.",
    "identifier": "national-insurance-record"
  },
  {
    "description": "Check national insurance numbers insights from Customer Insight Platform.",
    "identifier": "nino-gateway"
  },
  {
    "description": "This API retrieves obligations for business income sources, final declaration and the End of Period Statement.",
    "identifier": "obligations-api"
  },
  {
    "description": "This API allows 3rd-party providers to update HMRC on the status of Open Banking payments.",
    "identifier": "open-banking-external-api"
  },
  {
    "description": "This API creates, amends, retrieves and deletes deductions.",
    "identifier": "other-deductions-api"
  },
  {
    "description": "Set up test data for use with individual PAYE APIs including Individual Benefits, Individual Employment, Individual Income and Individual Tax.",
    "identifier": "paye-des-stub"
  },
  {
    "description": "This API allows 3rd-parties to check if a payment card is valid for use with a given tax regime, and reports applicable surcharges.",
    "identifier": "payments-bin-check"
  },
  {
    "description": "Send charge reference information to ETMP via DES and update the tps-payments-backend mongo repository with the information received.",
    "identifier": "payments-processor"
  },
  {
    "description": "An API that allows users to manage UK, Foreign, Historic and Non-Furnished Holiday Let (FHL) submission and summaries.",
    "identifier": "property-business-api"
  },
  {
    "description": "Send (push) and get (pull) notifications using this API.",
    "identifier": "push-pull-notifications-api"
  },
  {
    "description": "Check a pension scheme member’s residency for tax purposes and making relief at source claims.",
    "identifier": "ras-api"
  },
  {
    "description": "This API lists the files available for download through the Secure Data Exchange Service (SDES) and provides a download URL.",
    "identifier": "secure-data-exchange-bulk-download"
  },
  {
    "description": "Notify users that a bulk file transfer in the Secure Data Exchange Service is ready for processing or complete.",
    "identifier": "secure-data-exchange-notifications"
  },
  {
    "description": "This API creates URLs for uploading one or multiple files to HMRC’s Secure Data Exchange Service (SDES). It is designed for use with Web Forms.",
    "identifier": "secure-data-exchange-service-misc-api"
  },
  {
    "description": "Retrieve overall liability broken down into overdue, payable and pending amounts.",
    "identifier": "self-assessment-accounts-api"
  },
  {
    "description": "This API manages generating the HMRC Assist Report.",
    "identifier": "self-assessment-assist"
  },
  {
    "description": "Retrieve a summary of income and expenditure for a specific self-employment, or property business.",
    "identifier": "self-assessment-biss-api"
  },
  {
    "description": "An API to access Business Source Adjustable Summary (BSAS) calculations for self-employment or a property business.\n\nGenerate lists, request/provide a BSAS and adjustments.",
    "identifier": "self-assessment-bsas-api"
  },
  {
    "description": "Perform operations related to Individuals/Taxable Entities for Income Tax Self Assessment.",
    "identifier": "self-assessment-individual-details-api"
  },
  {
    "description": "Manage annual and period summaries and submissions for self employment.",
    "identifier": "self-employment-business-api"
  },
  {
    "description": "Get a link to a web-session for the current API user.",
    "identifier": "sso-session-api"
  },
  {
    "description": "Use this API to send a browser link containing a session info ID.",
    "identifier": "sso-session-link-api"
  },
  {
    "description": "For the Department of Work and Pensions (DWP) only. Calculate an individual’s state pension.",
    "identifier": "state-pension-calculation"
  },
  {
    "description": "An API to generate a customers’ statement of liability.",
    "identifier": "statement-of-liability"
  },
  {
    "description": "This API verifies a user’s identity through a telephony system by checking personal information including partner’s date of birth, bank account number or previous postcode. It logs whether the attempt was successful or failed.",
    "identifier": "telephony-identity-verification-api"
  },
  {
    "description": "Create individual, VAT trader, employer entities that can be accessed using the Telephony Identity Verification API. For use in the sandbox environment.",
    "identifier": "telephony-identity-verification-test-api"
  },
  {
    "description": "Use this API to generate or promote a Time To Pay (TTP) request, get or update existing TTP plans, and return affordable quotes.",
    "identifier": "time-to-pay-proxy"
  },
  {
    "description": "Check the value and format of fraud prevention headers on individual requests. The API provides feedback if issues are found.",
    "identifier": "txm-fph-validator-api"
  },
  {
    "description": "Manage VAT reporting including submitting and viewing a return, plus retrieve information about liability, payments, penalties and obligations. ",
    "identifier": "vat-api"
  },
  {
    "description": "Check the registration and company details for UK VAT numbers. This API also generates a reference to prove a check has been made.",
    "identifier": "vat-registered-companies-api"
  }
]